Repository: Guisardo/waterfly-iii
Catalog: lib/l10n/app_*.arb
Languages: es

# accountRoleAssetCashWallet
source: Cash Wallet
es: Billetera de efectivo

# accountRoleAssetCC
source: Credit card
es: Tarjeta de crédito

# accountRoleAssetDefault
source: Default asset account
es: Cuenta de activos por defecto

# accountRoleAssetSavings
source: Savings account
es: Cuenta de ahorros

# accountRoleAssetShared
source: Shared asset account
es: Cuenta de activos compartida

# accountsLabelAsset
source: Asset Accounts
es: Cuentas de activos

# accountsLabelExpense
source: Expense Accounts
es: Cuentas de gastos

# accountsLabelLiabilities
source: Liabilities
es: Pasivos

# accountsLabelRevenue
source: Revenue Accounts
es: Cuentas de ingresos

# accountsLiabilitiesInterest
source: {interest}% interest per {period, select, weekly{week} monthly{month} quarterly{quarter} halfyear{half-year} yearly{year} other{unknown}}
es: {interest}% de interés por {period, select, weekly{semana} monthly{mes} quarterly{trimestre} halfyear{semestre} yearly{año} other{desconocido}}

# billsAmountAndFrequency
source: Subscription matches transactions between {minValue} and {maxvalue}. Repeats {frequency, select, weekly{weekly} monthly{monthly} quarterly{quarterly} halfyear{half-yearly} yearly{yearly} other{unknown}}{skip, plural, =0{} other{, skips over {skip}}}.
es: Factura coincide con transacciones entre {minValue} y {maxvalue}. Se repite {frequency, select, weekly{semanalmente} monthly{mensualmente} quarterly{trimestralmente} halfyear{semestralmente} yearly{anualmente} other{desconocido}}{skip, plural, =0{} other{, saltarse {skip}}}.

# billsChangeLayoutTooltip
source: Change layout
es: Cambiar diseño

# billsChangeSortOrderTooltip
source: Change sort order
es: Cambiar orden de clasificación

# billsErrorLoading
source: Error loading subscriptions.
es: Error al cargar facturas.

# billsExactAmountAndFrequency
source: Subscription matches transactions of {value}. Repeats {frequency, select, weekly{weekly} monthly{monthly} quarterly{quarterly} halfyear{half-yearly} yearly{yearly} other{unknown}}{skip, plural, =0{} other{, skips over {skip}}}.
es: La factura coincide con las transacciones de {value}. Se repite {frequency, select, weekly{semanalmente} monthly{mensualmente} quarterly{trimestralmente} halfyear{semestralmente} yearly{anualmente} other{desconocido}}{skip, plural, =0{} other{, saltarse {skip}}}.

# billsExpectedOn
source: Expected {date}
es: Esperado {date}

# billsFrequency
source: {frequency, select, weekly{Weekly} monthly{Monthly} quarterly{Quarterly} halfyear{Half-yearly} yearly{Yearly} other{Unknown}}
es: {frequency, select, weekly{Semanal} monthly{Mensual} quarterly{Trimestral} halfyear{Semestral} yearly{Anual} other{Desconocido}}

# billsFrequencySkip
source: {frequency, select, weekly{Weekly} monthly{Monthly} quarterly{Quarterly} halfyear{Half-yearly} yearly{Yearly} other{Unknown}}{skip, plural, =0{} other{, skips over {skip}}}
es: {frequency, select, weekly{Semanal} monthly{Mensual} quarterly{Trimestral} halfyear{Semestral} yearly{Anual} other{Desconocido}}{skip, plural, =0{} other{, saltarse {skip}}}

# billsInactive
source: Inactive
es: Inactiva

# billsIsActive
source: Subscription is active
es: La factura está activa

# billsLayoutGroupSubtitle
source: Subscriptions displayed in their assigned groups.
es: Facturas mostradas en sus grupos asignados.

# billsLayoutGroupTitle
source: Group
es: Grupo

# billsLayoutListSubtitle
source: Subscriptions displayed in a list sorted by certain criteria.
es: Facturas mostradas en una lista ordenada por ciertos criterios.

# billsLayoutListTitle
source: List
es: Lista

# billsListEmpty
source: The list is currently empty.
es: La lista está actualmente vacía.

# billsNextExpectedMatch
source: Next expected match
es: Próxima coincidencia esperada

# billsNotActive
source: Subscription is inactive
es: La factura está inactiva

# billsNotExpected
source: Not expected this period
es: No se esperaba este período

# billsNoTransactions
source: No transactions found.
es: No se encontraron transacciones.

# billsPaidOn
source: Paid {date}
es: Pagado {date}

# billsSortAlphabetical
source: Alphabetical
es: Alfabético

# billsSortByTimePeriod
source: By time period
es: Por período de tiempo

# billsSortFrequency
source: Frequency
es: Frecuencia

# billsSortName
source: Name
es: Nombre

# billsUngrouped
source: Ungrouped
es: Sin agrupar

# billsSettingsShowOnlyActive
source: Show only active
es: Mostrar solo activos

# billsSettingsShowOnlyActiveDesc
source: Shows only active subscriptions.
es: Muestra solo las suscripciones activas.

# billsSettingsShowOnlyExpected
source: Show only expected
es: Mostrar solo esperados

# billsSettingsShowOnlyExpectedDesc
source: Shows only those subscriptions that are expected (or paid) this month.
es: Muestra solo las suscripciones que se esperan (o pagan) este mes.

# categoryDeleteConfirm
source: Are you sure you want to delete this category? The transactions will not be deleted, but will not have a category anymore.
es: ¿Estás seguro de que deseas eliminar esta categoría? Las transacciones no serán eliminadas, pero ya no tendrán categoría.

# categoryErrorLoading
source: Error loading categories.
es: Error cargando categorías.

# categoryFormLabelIncludeInSum
source: Include in monthly sum
es: Incluir en suma mensual

# categoryFormLabelName
source: Category Name
es: Nombre de la categoría

# categoryMonthNext
source: Next Month
es: Próximo Mes

# categoryMonthPrev
source: Previous Month
es: Mes anterior

# categorySumExcluded
source: excluded
es: excluida

# categoryTitleAdd
source: Add Category
es: Agregar categoría

# categoryTitleDelete
source: Delete Category
es: Eliminar categoría

# categoryTitleEdit
source: Edit Category
es: Editar categoría

# catNone
source: <no category>
es: (sin categoría)

# catOther
source: Other
es: Otros

# errorAPIInvalidResponse
source: Invalid Response from API: {message}
es: Respuesta inválida de la API: {message}

# errorAPIUnavailable
source: API unavailable
es: API no disponible

# errorFieldRequired
source: This field is required.
es: Este campo es obligatorio.

# errorInvalidURL
source: Invalid URL
es: URL inválida

# errorMinAPIVersion
source: Minimum Firefly API Version v{requiredVersion} required. Please upgrade.
es: Se requiere una versión mínima de la API Firefly -{requiredVersion} Por favor, actualice.

# errorStatusCode
source: Status Code: {code}
es: Código de estado: {code}

# errorUnknown
source: Unknown error.
es: Error desconocido.

# formButtonHelp
source: Help
es: Ayuda

# formButtonLogin
source: Login
es: Iniciar Sesión

# formButtonLogout
source: Logout
es: Cerrar sesión

# formButtonRemove
source: Remove
es: Eliminar

# formButtonResetLogin
source: Reset login
es: Restablecer inicio de sesión

# formButtonTransactionAdd
source: Add Transaction
es: Añadir Transacción

# formButtonTryAgain
source: Try again
es: Inténtalo de nuevo

# generalAccount
source: Account
es: Cuenta

# generalAssets
source: Assets
es: Activos

# generalBalance
source: Balance
es: Saldo

# generalBalanceOn
source: Balance on {date}
es: Saldo a {date}

# generalBill
source: Subscription
es: Factura

# generalBudget
source: Budget
es: Presupuesto

# generalCategory
source: Category
es: Categoría

# generalCurrency
source: Currency
es: Divisa

# generalDateRangeCurrentMonth
source: Current Month
es: Mes actual

# generalDateRangeLast30Days
source: Last 30 days
es: Últimos 30 días

# generalDateRangeCurrentYear
source: Current Year
es: Año actual

# generalDateRangeLastYear
source: Last year
es: Año pasado

# generalDateRangeAll
source: All
es: Todos

# generalDefault
source: default
es: por defecto

# generalDestinationAccount
source: Destination Account
es: Cuenta de Destino

# generalDismiss
source: Dismiss
es: Descartar

# generalEarned
source: Earned
es: Ingresado

# generalExpenses
source: Expenses
es: Gastos

# generalIncome
source: Income
es: Ingresos

# generalLiabilities
source: Liabilities
es: Pasivos

# generalMultiple
source: multiple
es: múltiple

# generalNever
source: never
es: nunca

# generalOffline
source: Offline
es: Sin conexión

# generalOfflineMessage
source: You are offline. Connect to sync.
es: Estás sin conexión. Conéctate para sincronizar.

# generalReconcile
source: Reconciled
es: Reconciliado

# generalReset
source: Reset
es: Restablecer

# generalSourceAccount
source: Source Account
es: Cuenta de Origen

# generalSpent
source: Spent
es: Gastado

# generalSum
source: Sum
es: Suma

# generalTarget
source: Target
es: Objetivo

# generalUnknown
source: Unknown
es: Desconocido

# homeMainBillsInterval
source: ({period, select, weekly{weekly} monthly{monthly} quarterly{quarterly} halfyear{half-year} yearly{yearly} other{unknown}})
es: ({period, select, weekly{semanalmente} monthly{mensualmente} quarterly{trimestralmente} halfyear{semestralmente} yearly{anualmente} other{desconocido}})

# homeMainBillsTitle
source: Subscriptions for the next week
es: Facturas para la próxima semana

# homeMainBudgetInterval
source: ({from} to {to}, {period})
es: ({from} hasta {to}, {period})

# homeMainBudgetIntervalSingle
source: ({from} to {to})
es: ({from} hasta {to})

# homeMainBudgetSum
source: {current} {status, select, over{over} other{left from}} {available}
es: {current} {status, select, over{más de} other{restante}} {available}

# homeMainBudgetTitle
source: Budgets for current month
es: Presupuestos para el mes actual

# homeMainChartAccountsTitle
source: Account Summary
es: Resumen de la cuenta

# homeMainChartCategoriesTitle
source: Category Summary for current month
es: Resumen de categoría para el mes actual

# homeMainChartDailyAvg
source: 7 days average
es: promedio de 7 días

# homeMainChartDailyTitle
source: Daily Summary
es: Resumen diario

# homeMainChartNetEarningsTitle
source: Net Earnings
es: Beneficio

# homeMainChartNetWorthTitle
source: Net Worth
es: Valor neto

# homeMainChartTagsTitle
source: Tag Summary for current month
es: Resumen de etiquetas del mes actual

# homePiggyAdjustDialogTitle
source: Save/Spend Money
es: Ahorrar/Gastar dinero

# homePiggyDateStart
source: Start date: {date}
es: Fecha de inicio: {date}

# homePiggyDateTarget
source: Target date: {date}
es: Fecha objetivo: {date}

# homeMainDialogSettingsTitle
source: Customize Dashboard
es: Personalizar el panel

# homePiggyLinked
source: Linked to {account}
es: Vinculado a {account}

# homePiggyNoAccounts
source: No piggy banks set up.
es: No se han creado huchas.

# homePiggyNoAccountsSubtitle
source: Create some in the webinterface!
es: ¡Cree alguna en la interfaz web!

# homePiggyRemaining
source: Left to save: {amount}
es: Pendiente de ahorrar: {amount}

# homePiggySaved
source: Saved so far: {amount}
es: Ahorrado hasta ahora: {amount}

# homePiggySavedMultiple
source: Saved so far:
es: Ahorrado hasta ahora:

# homePiggyTarget
source: Target amount: {amount}
es: Objetivo de ahorro: {amount}

# homePiggyAccountStatus
source: Account Status
es: Estado de la cuenta

# homePiggyAvailableAmounts
source: Available Amounts
es: Cantidades disponibles

# homePiggyAvailable
source: Available: {amount}
es: Disponible: {amount}

# homePiggyInPiggyBanks
source: In piggy banks: {amount}
es: En huchas: {amount}

# homeTabLabelBalance
source: Balance Sheet
es: Hoja de balance

# homeTabLabelMain
source: Main
es: Principal

# homeTabLabelPiggybanks
source: Piggy Banks
es: Huchas

# homeTabLabelTransactions
source: Transactions
es: Transacciones

# homeTransactionsActionFilter
source: Filter List
es: Listado de filtros

# homeTransactionsDialogFilterAccountsAll
source: <All Accounts>
es: <Todas las cuentas>

# homeTransactionsDialogFilterBillsAll
source: <All Subscriptions>
es: <Todas las facturas>

# homeTransactionsDialogFilterBillUnset
source: <No Subscription set>
es: <Factura no establecida>

# homeTransactionsDialogFilterBudgetsAll
source: <All Budgets>
es: <Todos los presupuestos>

# homeTransactionsDialogFilterBudgetUnset
source: <No Budget set>
es: <Presupuesto no establecido>

# homeTransactionsDialogFilterCategoriesAll
source: <All Categories>
es: <Todas las categorías>

# homeTransactionsDialogFilterCategoryUnset
source: <No Category set>
es: <Categoría no establecida>

# homeTransactionsDialogFilterCurrenciesAll
source: <All Currencies>
es: <Todas las divisas>

# homeTransactionsDialogFilterDateRange
source: Date Range
es: Rango de fechas

# homeTransactionsDialogFilterFutureTransactions
source: Show future transactions
es: Mostrar transacciones futuras

# homeTransactionsDialogFilterSearch
source: Search Term
es: Término de búsqueda

# homeTransactionsDialogFilterTitle
source: Select filters
es: Seleccionar filtros

# homeTransactionsEmpty
source: No transactions found.
es: No se encontraron transacciones.

# homeTransactionsMultipleCategories
source: {num} categories
es: {num} categorías

# homeTransactionsSettingsShowTags
source: Show tags in transaction list
es: Mostrar etiquetas en la lista de transacciones

# liabilityDirectionCredit
source: I am owed this debt
es: Se me debe esta deuda

# liabilityDirectionDebit
source: I owe this debt
es: Le debo esta deuda a otra persona

# liabilityTypeDebt
source: Debt
es: Deuda

# liabilityTypeLoan
source: Loan
es: Préstamo

# liabilityTypeMortgage
source: Mortgage
es: Hipoteca

# loginAbout
source: To use Waterfly III productively you need your own server with a Firefly III instance or the Firefly III add-on for Home Assistant. Please enter the full URL as well as a personal access token (Settings -> Profile -> OAuth -> Personal Access Token) below.
es: Para usar Waterfly III es necesario disponer de un servidor con una instancia de Firefly III o del add-on de Firefly III para Home Assistant. Por favor, introduzca la URL completa y el token de acceso personal (Ajustes -> Perfil -> OAuth -> Token de Acceso Personal) debajo.

# loginFormLabelAPIKey
source: Valid API Key
es: Clave API válida

# loginFormLabelHost
source: Host URL
es: URL del servidor

# loginWelcome
source: Welcome to Waterfly III
es: Bienvenido a Waterfly III

# logoutConfirmation
source: Are you sure you want to log out?
es: ¿Estás seguro de que deseas cerrar sesión?

# navigationAccounts
source: Accounts
es: Cuentas

# navigationBills
source: Subscriptions
es: Facturas

# navigationCategories
source: Categories
es: Categorías

# navigationMain
source: Main Dashboard
es: Panel principal

# generalSettings
source: Settings
es: Configuración

# generalSyncEntity
source: Sync {entity}
es: Sincronizar {entity}

# generalSyncComplete
source: Synced {count} {entity}
es: Sincronizados {count} {entity}

# generalSyncFailed
source: Sync failed: {error}
es: Error de sincronización: {error}

# generalSyncNotAvailable
source: Sync service not available
es: Servicio de sincronización no disponible

# numPercentOf
source: {perc} of {of}
es: {perc} de {of}

# settingsDialogDebugInfo
source: You can enable & send debug logs here. These have a bad impact on performance, so please don't enable them unless you're advised to do so. Disabling logging will delete the stored log.
es: Puede activar y enviar los registros de depuración desde aquí. Su activación tiene un impacto perjudicial en el rendimiento, así que no los active a no ser que se le haya recomendado. Desactivar los registros elimina los guardados anteriormente.

# settingsDialogDebugMailCreate
source: Create Mail
es: Crear email

# settingsDialogDebugMailDisclaimer
source: WARNING: A mail draft will open with the log file attached (in text format). The logs might contain sensitive information, such as the host name of your Firefly instance (though I try to avoid logging of any secrets, such as the api key). Please read through the log carefully and censor out any information you don't want to share and/or is not relevant to the problem you want to report. Please do not send in logs without prior agreement via mail/GitHub to do so. I will delete any logs sent without context for privacy reasons. Never upload the log uncensored to GitHub or elsewhere.
es: ATENCIÓN: Se abrirá un borrador de email con los registros de depuración como archivo adjunto (en formato de texto). Los registros pueden contener información sensible, como el nombre del anfitrión de su instancia de Firefly (aunque se ha tratado de no registrar secretos, como la clave API). Por favor, revise los registros cuidadosamente y censure cualquier información que no desea compartir y/o no es relevante para el problema sobre el que quiere informar.

# settingsDialogDebugSendButton
source: Send Logs via Mail
es: Enviar registros por correo

# settingsDialogDebugTitle
source: Debug Logs
es: Registros de depuración

# settingsDialogLanguageTitle
source: Select Language
es: Seleccionar idioma

# settingsDialogThemeTitle
source: Select Theme
es: Seleccionar tema

# settingsFAQHelp
source: Opens in Browser. Only available in English.
es: Se abre en el navegador. Sólo disponible en inglés.

# settingsOfflineModeSubtitle
source: Configure offline sync and mobile data usage
es: Configurar sincronización sin conexión y uso de datos móviles

# settingsLanguage
source: Language
es: Idioma

# settingsLockscreen
source: Lockscreen
es: Pantalla de bloqueo

# settingsLockscreenHelp
source: Require authenticiation on app startup
es: Requerir autenticación al iniciar la aplicación

# settingsLockscreenInitial
source: Please authenticate to enable the lock screen.
es: Por favor, autentíquese para activar la pantalla de bloqueo.

# settingsNLAppAccount
source: Default Account
es: Cuenta por defecto

# settingsNLAppAccountDynamic
source: <Dynamic>
es: <Dinámico>

# settingsNLAppAdd
source: Add App
es: Añadir aplicación

# settingsNLAppAddHelp
source: Click to add an app to listen to. Only eligible apps will show up in the list.
es: Haga clic para añadir una aplicación para escuchar. Sólo las aplicaciones elegibles aparecerán en la lista.

# settingsNLAppAddInfo
source: Make some transactions where you receive phone notifications to add apps to this list. If the app still doesn't show up, please report it to app@vogt.pw.
es: Haga algunas transacciones que generen notificaciones en el teléfono para añadir aplicaciones a esta lista. Si la aplicación todavía no aparece, por favor, informe a app@vogt.pw.

# settingsNLAutoAdd
source: Create transaction without interaction
es: Crear transacción sin interacción

# settingsNLDescription
source: This service allows you to fetch transaction details from incoming push notifications. Additionally, you can select a default account which the transaction should be assigned to - if no value is set, it tries to extract an account from the notification.
es: Este servicio permite obtener detalles de la transacción a partir de notificaciones entrantes. Además, puede seleccionar una cuenta por defecto a la que asignar la transacción. Si no se establece ningún valor, trata de extraer la información de la notificación.

# settingsNLEmptyNote
source: Keep note field empty
es: Mantener campo nota vacío

# settingsNLPermissionGrant
source: Tap to grant permission.
es: Toque para conceder permiso.

# settingsNLPermissionNotGranted
source: Permission not granted.
es: Permiso no concedido.

# settingsNLPermissionRemove
source: Remove permission?
es: Quitar el permiso?

# settingsNLPermissionRemoveHelp
source: To disable this service, click on the app and remove the permissions in the next screen.
es: Para desactivar este servicio, haga clic en la aplicación y elimine los permisos en la siguiente pantalla.

# settingsNLPrefillTXTitle
source: Prefill transaction title with notification title
es: Rellenar el título de la transacción con el título de la notificación

# settingsNLServiceChecking
source: Checking status…
es: Comprobando estado…

# settingsNLServiceCheckingError
source: Error checking status: {error}
es: Error comprobando estado: {error}

# settingsNLServiceRunning
source: Service is running.
es: El servicio se está ejecutando.

# settingsNLServiceStatus
source: Service Status
es: Estado del servicio

# settingsNLServiceStopped
source: Service is stopped.
es: El servicio está detenido.

# settingsNotificationListener
source: Notification Listener Service
es: Servicio de escucha de notificaciones

# settingsTheme
source: App Theme
es: Tema de la aplicación

# settingsThemeDynamicColors
source: Dynamic Colors
es: Colores dinámicos

# settingsThemeValue
source: {theme, select, dark{Dark Mode} light{Light Mode} other{System Default}}
es: {theme, select, dark{Modo Oscuro} light{Modo Luz} other{Predeterminado del sistema}}

# settingsUseServerTimezone
source: Use server timezone
es: Usar la zona horaria del servidor

# settingsUseServerTimezoneHelp
source: Show all times in the server timezone. This mimics the behavior of the webinterface.
es: Mostrar todas las horas en la zona horaria del servidor. Esto imita el comportamiento de la interfaz web.

# settingsVersion
source: App Version
es: Versión de la aplicación

# settingsVersionChecking
source: checking…
es: comprobando…

# transactionAttachments
source: Attachments
es: Archivos adjuntos

# transactionDeleteConfirm
source: Are you sure you want to delete this transaction?
es: ¿Seguro que desea eliminar esta transacción?

# transactionDialogAttachmentsDelete
source: Delete Attachment
es: Eliminar archivo adjunto

# transactionDialogAttachmentsDeleteConfirm
source: Are you sure you want to delete this attachment?
es: ¿Está seguro de que desea eliminar el archivo adjunto?

# transactionDialogAttachmentsErrorDownload
source: Could not download file.
es: No se pudo descargar el archivo.

# transactionDialogAttachmentsErrorOpen
source: Could not open file: {error}
es: No se pudo abrir el archivo: {error}

# transactionDialogAttachmentsErrorUpload
source: Could not upload file: {error}
es: No se pudo subir el archivo: {error}

# transactionDialogAttachmentsTitle
source: Attachments
es: Archivos adjuntos

# transactionDialogBillNoBill
source: No subscription
es: Sin factura

# transactionDialogBillTitle
source: Link to Subscription
es: Enlace a la factura

# transactionDialogCurrencyTitle
source: Select currency
es: Seleccionar divisa

# transactionDialogPiggyNoPiggy
source: No Piggy Bank
es: Sin hucha

# transactionDialogPiggyTitle
source: Link to Piggy Bank
es: Vincular a hucha

# transactionDialogTagsAdd
source: Add Tag
es: Añadir etiqueta

# transactionDialogTagsHint
source: Search/Add Tag
es: Buscar/Añadir etiqueta

# transactionDialogTagsTitle
source: Select tags
es: Seleccionar etiquetas

# transactionDuplicate
source: Duplicate
es: Duplicado

# transactionErrorInvalidAccount
source: Invalid Account
es: Cuenta inválida

# transactionErrorInvalidBudget
source: Invalid Budget
es: Presupuesto inválido

# transactionErrorNoAccounts
source: Please fill in the accounts first.
es: Por favor, primero rellene las cuentas.

# transactionErrorNoAssetAccount
source: Please select an asset account.
es: Por favor, seleccione una cuenta de activo.

# transactionErrorTitle
source: Please provide a title.
es: Por favor, proporcione un título.

# transactionFormLabelAccountDestination
source: Destination account
es: Cuenta de destino

# transactionFormLabelAccountForeign
source: Foreign account
es: Cuenta extranjera

# transactionFormLabelAccountOwn
source: Own account
es: Cuenta propia

# transactionFormLabelAccountSource
source: Source account
es: Cuenta de origen

# transactionFormLabelNotes
source: Notes
es: Notas

# transactionFormLabelTags
source: Tags
es: Etiquetas

# transactionFormLabelTitle
source: Transaction Title
es: Título de la transacción

# transactionSplitAdd
source: Add split transaction
es: Añadir transacción dividida

# transactionSplitChangeCurrency
source: Change Split Currency
es: Cambiar moneda dividida

# transactionSplitChangeDestinationAccount
source: Change Split Destination Account
es: Cambiar cuenta de destino dividida
