Repository: Guisardo/waterfly-iii
Catalog: lib/l10n/app_*.arb
Languages: es

# syncFailedToStart
source: Failed to start sync: {error}
es: Error al iniciar la sincronización: {error}

# syncFailedToStartFull
source: Failed to start full sync: {error}
es: Error al iniciar la sincronización completa: {error}

# syncServiceNotAvailable
source: Sync service not available. Please restart the app.
es: Servicio de sincronización no disponible. Por favor, reinicie la aplicación.

# syncProgressProviderNotAvailable
source: Sync Status Provider Not Available
es: Proveedor de Estado de Sincronización No Disponible

# syncProgressProviderNotAvailableDesc
source: Please restart the app to enable sync progress tracking.
es: Por favor, reinicie la aplicación para habilitar el seguimiento del progreso de sincronización.

# syncProgressServiceUnavailable
source: Sync Service Unavailable
es: Servicio de Sincronización No Disponible

# syncProgressServiceUnavailableDesc
source: Sync Status Provider is not available. Please restart the app.
es: El Proveedor de Estado de Sincronización no está disponible. Por favor, reinicie la aplicación.

# syncProgressCancel
source: Cancel
es: Cancelar

# syncProgressFailed
source: Sync Failed
es: Sincronización Fallida

# syncProgressComplete
source: Sync Complete
es: Sincronización Completa

# syncProgressSyncing
source: Syncing...
es: Sincronizando...

# incrementalSyncCacheCurrent
source: Current: {ttl}
es: Actual: {ttl}

# syncStatusProgressComplete
source: {percentage}% complete
es: {percentage}% completo

# syncProgressSuccessfullySynced
source: Successfully synced {count} operations
es: Sincronizadas exitosamente {count} operaciones

# syncProgressConflictsDetected
source: {count} conflicts detected
es: {count} conflictos detectados

# syncProgressOperationsFailed
source: {count} operations failed
es: {count} operaciones fallaron

# syncProgressOperationsCount
source: {completed}/{total} operations
es: {completed}/{total} operaciones

# syncProgressSyncingOperations
source: Syncing operations...
es: Sincronizando operaciones...

# syncProgressPreparing
source: Preparing...
es: Preparando...

# syncProgressDetectingConflicts
source: Detecting conflicts...
es: Detectando conflictos...

# syncProgressResolvingConflicts
source: Resolving conflicts...
es: Resolviendo conflictos...

# syncProgressPullingUpdates
source: Pulling updates...
es: Obteniendo actualizaciones...

# syncProgressFinalizing
source: Finalizing...
es: Finalizando...

# syncProgressCompleted
source: Completed
es: Completado

# syncStatusSyncingCount
source: Syncing... {synced} of {total}
es: Sincronizando... {synced} de {total}

# listViewOfflineFilterPending
source: Pending
es: Pendiente

# listViewOfflineNoDataAvailable
source: No {entityType} Available
es: No hay {entityType} Disponibles

# listViewOfflineNoDataMessage
source: You are offline. {entityType} will appear here when you connect to the internet.
es: Estás sin conexión. {entityType} aparecerán aquí cuando te conectes a internet.

# listViewOfflineLastUpdated
source: Last updated {age}
es: Última actualización: {age}

# dashboardOfflineIncludesUnsynced
source: Includes unsynced data
es: Incluye datos no sincronizados

# dashboardOfflineDataAsOf
source: Data as of {age}
es: Datos desde {age}

# dashboardOfflineUnsynced
source: Unsynced
es: No sincronizado

# dashboardOfflineViewingOfflineData
source: Viewing offline data. Some information may be outdated.
es: Viendo datos sin conexión. Algunos datos pueden estar desactualizados.

# dashboardOfflineNoDataAvailable
source: No {dataType} Available
es: No hay {dataType} Disponibles

# dashboardOfflineConnectToLoad
source: Connect to the internet to load {dataType}
es: Conéctate a internet para cargar {dataType}

# dashboardOfflineDataOutdated
source: Data may be outdated. Last updated {age}.
es: Los datos pueden estar desactualizados. Última actualización: {age}.

# generalNetworkTypeMobile
source: Mobile Data
es: Datos Móviles

# generalNetworkTypeOther
source: Other
es: Otro

# generalNetworkTypeNone
source: None
es: Ninguno
