Repository: Guisardo/waterfly-iii
Catalog: lib/l10n/app_*.arb
Languages: es

# transactionSplitChangeSourceAccount
source: Change Split Source Account
es: Cambiar cuenta de origen dividida

# transactionSplitChangeTarget
source: Change Split Target Account
es: Cambiar cuenta de destina dividida

# transactionSplitDelete
source: Delete split
es: Eliminar división

# transactionTitleAdd
source: Add Transaction
es: Añadir Transacción

# transactionTitleDelete
source: Delete Transaction
es: Eliminar transacción

# transactionTitleEdit
source: Edit Transaction
es: Editar Transacción

# transactionTypeDeposit
source: Deposit
es: Ingreso

# transactionTypeTransfer
source: Transfer
es: Transferencia

# transactionTypeWithdrawal
source: Withdrawal
es: Retirada

# offlineSettingsTitle
source: Offline Mode Settings
es: Configuración del Modo Sin Conexión

# offlineSettingsHelp
source: Help
es: Ayuda

# offlineSettingsSynchronization
source: Synchronization
es: Sincronización

# offlineSettingsAutoSync
source: Auto-sync
es: Sincronización automática

# offlineSettingsAutoSyncDesc
source: Automatically sync in background
es: Sincronizar automáticamente en segundo plano

# offlineSettingsAutoSyncEnabled
source: Auto-sync enabled
es: Sincronización automática habilitada

# offlineSettingsAutoSyncDisabled
source: Auto-sync disabled
es: Sincronización automática deshabilitada

# offlineSettingsSyncInterval
source: Sync interval
es: Intervalo de sincronización

# offlineSettingsWifiOnly
source: WiFi only
es: Solo WiFi

# offlineSettingsWifiOnlyDesc
source: Sync only when connected to WiFi
es: Sincronizar solo cuando esté conectado a WiFi

# offlineSettingsWifiOnlyEnabled
source: WiFi-only sync enabled
es: Sincronización solo WiFi habilitada

# offlineSettingsWifiOnlyDisabled
source: WiFi-only sync disabled
es: Sincronización solo WiFi deshabilitada

# offlineSettingsLastSync
source: Last sync: {time}
es: Última sincronización: {time}

# offlineSettingsNextSync
source: Next sync: {time}
es: Próxima sincronización: {time}

# offlineSettingsConflictResolution
source: Conflict Resolution
es: Resolución de Conflictos

# offlineSettingsResolutionStrategy
source: Resolution strategy
es: Estrategia de resolución

# offlineSettingsStorage
source: Storage
es: Almacenamiento

# offlineSettingsDatabaseSize
source: Database size
es: Tamaño de la base de datos

# offlineSettingsClearCache
source: Clear cache
es: Limpiar caché

# offlineSettingsClearCacheDesc
source: Remove temporary data
es: Eliminar datos temporales

# offlineSettingsClearAllData
source: Clear all data
es: Limpiar todos los datos

# offlineSettingsClearAllDataDesc
source: Remove all offline data
es: Eliminar todos los datos sin conexión

# offlineSettingsStatistics
source: Statistics
es: Estadísticas

# offlineSettingsTotalSyncs
source: Total syncs
es: Sincronizaciones totales

# offlineSettingsConflicts
source: Conflicts
es: Conflictos

# offlineSettingsErrors
source: Errors
es: Errores

# offlineSettingsSuccessRate
source: Success rate
es: Tasa de éxito

# offlineSettingsActions
source: Actions
es: Acciones

# offlineSettingsSyncing
source: Syncing...
es: Sincronizando...

# offlineSettingsSyncNow
source: Sync now
es: Sincronizar ahora

# offlineSettingsForceFullSync
source: Force full sync
es: Forzar sincronización completa

# offlineSettingsCheckConsistency
source: Check consistency
es: Verificar consistencia

# offlineSettingsChecking
source: Checking...
es: Verificando...

# offlineSettingsSyncIntervalTitle
source: Sync Interval
es: Intervalo de Sincronización

# offlineSettingsSyncIntervalSet
source: Sync interval set to {interval}
es: Intervalo de sincronización establecido en {interval}

# offlineSettingsConflictStrategyTitle
source: Conflict Resolution Strategy
es: Estrategia de Resolución de Conflictos

# offlineSettingsConflictStrategySet
source: Conflict strategy set to {strategy}
es: Estrategia de conflicto establecida en {strategy}

# offlineSettingsClearCacheTitle
source: Clear Cache
es: Limpiar Caché

# offlineSettingsClearCacheMessage
source: This will remove temporary data. Your offline data will be preserved.
es: Esto eliminará los datos temporales. Sus datos sin conexión se conservarán.

# offlineSettingsClearAllDataTitle
source: Clear All Data
es: Limpiar Todos los Datos

# offlineSettingsClearAllDataMessage
source: This will remove ALL offline data. This action cannot be undone. You will need to sync again to use offline mode.
es: Esto eliminará TODOS los datos sin conexión. Esta acción no se puede deshacer. Necesitará sincronizar nuevamente para usar el modo sin conexión.

# offlineSettingsCacheCleared
source: Cache cleared
es: Caché limpiado

# offlineSettingsAllDataCleared
source: All offline data cleared
es: Todos los datos sin conexión eliminados

# offlineSettingsPerformingSync
source: Performing sync...
es: Realizando sincronización...

# offlineSettingsPerformingIncrementalSync
source: Performing incremental sync...
es: Realizando sincronización incremental...

# offlineSettingsPerformingFullSync
source: Performing full sync...
es: Realizando sincronización completa...

# offlineSettingsIncrementalSyncCompleted
source: Incremental sync completed successfully
es: Sincronización incremental completada exitosamente

# offlineSettingsIncrementalSyncIssues
source: Incremental sync completed with issues: {error}
es: Sincronización incremental completada con problemas: {error}

# offlineSettingsForceFullSyncTitle
source: Force Full Sync
es: Forzar Sincronización Completa

# offlineSettingsForceFullSyncMessage
source: This will download all data from the server, replacing local data. This may take several minutes.
es: Esto descargará todos los datos del servidor, reemplazando los datos locales. Esto puede tardar varios minutos.

# offlineSettingsConsistencyCheckComplete
source: Consistency Check Complete
es: Verificación de Consistencia Completada

# offlineSettingsConsistencyCheckNoIssues
source: No issues found. Your data is consistent.
es: No se encontraron problemas. Sus datos son consistentes.

# offlineSettingsConsistencyCheckIssuesFound
source: {count} issue(s) found.
es: Se encontraron {count} problema(s).

# offlineSettingsConsistencyCheckIssueBreakdown
source: Issue breakdown:
es: Desglose de problemas:

# offlineSettingsConsistencyCheckMoreIssues
source: ... and {count} more
es: ... y {count} más

# offlineSettingsRepairInconsistencies
source: Repair Inconsistencies
es: Reparar Inconsistencias

# offlineSettingsRepairInconsistenciesMessage
source: This will attempt to automatically fix detected issues. Some issues may require manual intervention.
es: Esto intentará corregir automáticamente los problemas detectados. Algunos problemas pueden requerir intervención manual.

# offlineSettingsRepairComplete
source: Repair Complete
es: Reparación Completada

# offlineSettingsRepairCompleteMessage
source: {repaired} issue(s) repaired. {failed} issue(s) could not be repaired.
es: {repaired} problema(s) reparado(s). {failed} problema(s) no se pudieron reparar.

# offlineSettingsHelpTitle
source: Offline Mode Help
es: Ayuda del Modo Sin Conexión

# offlineSettingsHelpAutoSync
source: Auto-sync
es: Sincronización automática

# offlineSettingsHelpAutoSyncDesc
source: Automatically synchronize data in the background at the specified interval.
es: Sincronizar automáticamente los datos en segundo plano en el intervalo especificado.

# offlineSettingsHelpWifiOnly
source: WiFi Only
es: Solo WiFi

# offlineSettingsHelpWifiOnlyDesc
source: Only sync when connected to WiFi to save mobile data.
es: Sincronizar solo cuando esté conectado a WiFi para ahorrar datos móviles.

# offlineSettingsHelpConflictResolution
source: Conflict Resolution
es: Resolución de Conflictos

# offlineSettingsHelpConflictResolutionDesc
source: Choose how to handle conflicts when the same data is modified both locally and on the server.
es: Elija cómo manejar los conflictos cuando los mismos datos se modifican tanto localmente como en el servidor.

# offlineSettingsHelpConsistencyCheck
source: Consistency Check
es: Verificación de Consistencia

# offlineSettingsHelpConsistencyCheckDesc
source: Verify data integrity and fix any inconsistencies in the local database.
es: Verificar la integridad de los datos y corregir cualquier inconsistencia en la base de datos local.

# offlineSettingsStrategyLocalWins
source: Local Wins
es: Ganan los Locales

# offlineSettingsStrategyRemoteWins
source: Remote Wins
es: Ganan los Remotos

# offlineSettingsStrategyLastWriteWins
source: Last Write Wins
es: Gana la Última Escritura

# offlineSettingsStrategyManual
source: Manual Resolution
es: Resolución Manual

# offlineSettingsStrategyMerge
source: Merge Changes
es: Combinar Cambios

# offlineSettingsStrategyLocalWinsDesc
source: Always keep local changes
es: Siempre mantener los cambios locales

# offlineSettingsStrategyRemoteWinsDesc
source: Always keep server changes
es: Siempre mantener los cambios del servidor

# offlineSettingsStrategyLastWriteWinsDesc
source: Keep most recently modified version
es: Mantener la versión modificada más recientemente

# offlineSettingsStrategyManualDesc
source: Manually resolve each conflict
es: Resolver manualmente cada conflicto

# offlineSettingsStrategyMergeDesc
source: Automatically merge non-conflicting changes
es: Combinar automáticamente los cambios no conflictivos

# offlineSettingsJustNow
source: Just now
es: Ahora mismo

# offlineSettingsMinutesAgo
source: {minutes} minutes ago
es: hace {minutes} minutos

# offlineSettingsHoursAgo
source: {hours} hours ago
es: hace {hours} horas

# offlineSettingsDaysAgo
source: {days} days ago
es: hace {days} días

# offlineSettingsFailedToUpdateAutoSync
source: Failed to update auto-sync setting
es: Error al actualizar la configuración de sincronización automática

# offlineSettingsFailedToUpdateWifiOnly
source: Failed to update WiFi-only setting
es: Error al actualizar la configuración de solo WiFi

# offlineSettingsFailedToUpdateSyncInterval
source: Failed to update sync interval
es: Error al actualizar el intervalo de sincronización

# offlineSettingsFailedToUpdateConflictStrategy
source: Failed to update conflict strategy
es: Error al actualizar la estrategia de conflicto

# offlineSettingsFailedToClearCache
source: Failed to clear cache: {error}
es: Error al limpiar la caché: {error}

# offlineSettingsFailedToClearData
source: Failed to clear data
es: Error al limpiar los datos

# offlineSettingsSyncFailed
source: Sync failed: {error}
es: Error en la sincronización: {error}

# offlineSettingsFullSyncFailed
source: Full sync failed: {error}
es: Error en la sincronización completa: {error}

# offlineSettingsConsistencyCheckFailed
source: Consistency check failed: {error}
es: Error en la verificación de consistencia: {error}

# offlineSettingsRepairFailed
source: Repair failed: {error}
es: Error en la reparación: {error}

# offlineSettingsIncrementalSyncNotAvailable
source: Incremental sync not available. Please perform a full sync first.
es: La sincronización incremental no está disponible. Por favor, realice una sincronización completa primero.

# offlineSettingsIncrementalSyncFailed
source: Incremental sync failed: {error}
es: Error en la sincronización incremental: {error}

# offlineSettingsSyncServiceNotAvailable
source: Sync service not available. Please restart the app.
es: Servicio de sincronización no disponible. Por favor, reinicie la aplicación.

# offlineSettingsFailedToGetSyncService
source: Failed to get sync service: {error}
es: Error al obtener el servicio de sincronización: {error}

# offlineSettingsIncrementalSyncServiceNotAvailable
source: Incremental sync service not available
es: Servicio de sincronización incremental no disponible

# offlineSettingsDismiss
source: Dismiss
es: Descartar

# offlineSettingsSyncInterval15Minutes
source: 15 minutes
es: 15 minutos

# offlineSettingsSyncInterval30Minutes
source: 30 minutes
es: 30 minutos

# offlineSettingsSyncInterval1Hour
source: 1 hour
es: 1 hora

# offlineSettingsSyncInterval6Hours
source: 6 hours
es: 6 horas

# offlineSettingsSyncInterval12Hours
source: 12 hours
es: 12 horas

# offlineSettingsSyncInterval24Hours
source: 24 hours
es: 24 horas

# incrementalSyncTitle
source: Incremental Sync
es: Sincronización Incremental

# incrementalSyncDescription
source: Optimize sync performance by fetching only changed data
es: Optimizar el rendimiento de sincronización obteniendo solo datos modificados

# incrementalSyncEnable
source: Enable Incremental Sync
es: Habilitar Sincronización Incremental

# incrementalSyncEnabledDesc
source: Fetch only changed data since last sync (70-80% faster)
es: Obtener solo datos modificados desde la última sincronización (70-80% más rápido)

# incrementalSyncDisabledDesc
source: Full sync fetches all data each time
es: La sincronización completa obtiene todos los datos cada vez

source: Incremental sync enabled
es: Sincronización incremental habilitada

source: Incremental sync disabled
es: Sincronización incremental deshabilitada

# incrementalSyncFailedToUpdate
source: Failed to update setting
es: Error al actualizar la configuración

# incrementalSyncWindow
source: Sync Window
es: Ventana de Sincronización

# incrementalSyncWindowDesc
source: How far back to look for changes
es: Cuánto tiempo atrás buscar cambios

# incrementalSyncWindowSet
source: Sync window set to {window}
es: Ventana de sincronización establecida en {window}

# incrementalSyncWindowFailed
source: Failed to update sync window
es: Error al actualizar la ventana de sincronización

# incrementalSyncCacheDuration
source: Cache Duration
es: Duración de la Caché

# incrementalSyncCacheDurationDesc
source: How long to cache categories, bills, and piggy banks before refreshing. These entities change infrequently, so longer cache durations reduce API calls.
es: Cuánto tiempo almacenar en caché categorías, facturas y alcancías antes de actualizar. Estas entidades cambian con poca frecuencia, por lo que duraciones de caché más largas reducen las llamadas a la API.

# incrementalSyncCacheDurationFailed
source: Failed to update cache duration
es: Error al actualizar la duración de la caché

# incrementalSyncLastIncremental
source: Last Incremental Sync
es: Última Sincronización Incremental

# incrementalSyncLastFull
source: Last Full Sync
es: Última Sincronización Completa

# incrementalSyncNever
source: Never
es: Nunca

# incrementalSyncToday
source: Today
es: Hoy

# incrementalSyncDaysAgo
source: {days}d ago
es: hace {days}d

# incrementalSyncFullSyncRecommended
source: Full Sync Recommended
es: Sincronización Completa Recomendada

# incrementalSyncFullSyncRecommendedDesc
source: It's been more than 7 days since the last full sync. A full sync is recommended to ensure data integrity.
es: Han pasado más de 7 días desde la última sincronización completa. Se recomienda una sincronización completa para garantizar la integridad de los datos.

# incrementalSyncIncrementalButton
source: Incremental Sync
es: Sincronización Incremental

# incrementalSyncFullButton
source: Full Sync
es: Sincronización Completa

# incrementalSyncResetStatistics
source: Reset Statistics
es: Restablecer Estadísticas

# incrementalSyncResetting
source: Resetting...
es: Restableciendo...

# incrementalSyncResetStatisticsTitle
source: Reset Statistics
es: Restablecer Estadísticas

# incrementalSyncResetStatisticsMessage
source: This will clear all incremental sync statistics (items fetched, bandwidth saved, etc.). Settings will be preserved. This action cannot be undone.
es: Esto eliminará todas las estadísticas de sincronización incremental (elementos obtenidos, ancho de banda ahorrado, etc.). La configuración se conservará. Esta acción no se puede deshacer.

# incrementalSyncResetStatisticsSuccess
source: Statistics reset successfully
es: Estadísticas restablecidas exitosamente

# incrementalSyncResetStatisticsFailed
source: Failed to reset statistics
es: Error al restablecer las estadísticas

# incrementalSyncWindowLabel
source: Sync window:
es: Ventana de sincronización:

# incrementalSyncFullSyncEnabled
source: Full sync enabled
es: Sincronización completa habilitada

# incrementalSyncWindowDays
source: {days} days
es: {days} días

# incrementalSyncCacheHours
source: {hours} hours
es: {hours} horas

# incrementalSyncWindowWord
source: window
es: ventana

# generalBackOnline
source: Back online
es: Conectado nuevamente

# generalOfflineModeWifiOnly
source: Offline mode (WiFi only)
es: Modo sin conexión (solo WiFi)

# generalCheckingConnection
source: Checking connection...
es: Verificando conexión...

# generalNetworkStatus
source: Network Status
es: Estado de la Red

# generalAppStatus
source: App Status
es: Estado de la Aplicación

# generalOnline
source: Online
es: En línea

# generalNetwork
source: Network
es: Red

# generalNoConnection
source: No connection
es: Sin conexión

# generalWifiOnlyModeEnabled
source: WiFi-only mode is enabled. Mobile data is disabled. Connect to WiFi to use online features.
es: El modo solo WiFi está habilitado. Los datos móviles están deshabilitados. Conéctese a WiFi para usar las funciones en línea.

# generalOfflineFeaturesLimited
source: Some features may be limited while offline. Data will sync automatically when connection is restored.
es: Algunas funciones pueden estar limitadas sin conexión. Los datos se sincronizarán automáticamente cuando se restaure la conexión.

# generalAllFeaturesAvailable
source: All features are available.
es: Todas las funciones están disponibles.

# generalConnectionRestored
source: Connection restored!
es: ¡Conexión restaurada!

# generalStillOffline
source: Still offline. Please check your network settings.
es: Todavía sin conexión. Por favor, verifique la configuración de su red.

# generalFailedToCheckConnectivity
source: Failed to check connectivity
es: Error al verificar la conectividad

# generalRetry
source: Retry
es: Reintentar

# incrementalSyncStatsTitle
source: Sync Statistics
es: Estadísticas de Sincronización

# incrementalSyncStatsDescription
source: {count} incremental syncs performed
es: {count} sincronizaciones incrementales realizadas

# incrementalSyncStatsDescriptionEmpty
source: Track sync efficiency and bandwidth savings
es: Rastree la eficiencia de sincronización y el ahorro de ancho de banda

# incrementalSyncStatsRefresh
source: Refresh statistics
es: Actualizar estadísticas

# incrementalSyncStatsNoData
source: No Sync Statistics Yet
es: Aún No Hay Estadísticas de Sincronización

# incrementalSyncStatsNoDataDesc
source: Statistics will appear here after your first incremental sync.
es: Las estadísticas aparecerán aquí después de su primera sincronización incremental.

# incrementalSyncStatsNoDataYet
source: No incremental sync data yet
es: Aún no hay datos de sincronización incremental

# incrementalSyncStatsNoDataAvailable
source: No sync data available
es: No hay datos de sincronización disponibles

# incrementalSyncStatsEfficiencyExcellent
source: Excellent Efficiency
es: Eficiencia Excelente

# incrementalSyncStatsEfficiencyGood
source: Good Efficiency
es: Buena Eficiencia

# incrementalSyncStatsEfficiencyModerate
source: Moderate Efficiency
es: Eficiencia Moderada

# incrementalSyncStatsEfficiencyLow
source: Low Efficiency
es: Baja Eficiencia

# incrementalSyncStatsEfficiencyVeryLow
source: Very Low Efficiency
es: Eficiencia Muy Baja

# incrementalSyncStatsEfficiencyDescExcellent
source: Most data unchanged - incremental sync is very effective!
es: La mayoría de los datos sin cambios - ¡la sincronización incremental es muy efectiva!

# incrementalSyncStatsEfficiencyDescGood
source: Good savings - incremental sync is working well.
es: Buen ahorro - la sincronización incremental funciona bien.

# incrementalSyncStatsEfficiencyDescModerate
source: Moderate changes detected - some bandwidth saved.
es: Cambios moderados detectados - se ahorró algo de ancho de banda.

# incrementalSyncStatsEfficiencyDescLow
source: Many changes - consider adjusting sync window.
es: Muchos cambios - considere ajustar la ventana de sincronización.

# incrementalSyncStatsEfficiencyDescVeryLow
source: Most data changed - incremental sync provides minimal benefit.
es: La mayoría de los datos cambiaron - la sincronización incremental proporciona un beneficio mínimo.

# incrementalSyncStatsLabelFetched
source: Fetched
es: Obtenidos

# incrementalSyncStatsLabelUpdated
source: Updated
es: Actualizados

# incrementalSyncStatsLabelSkipped
source: Skipped
es: Omitidos

# incrementalSyncStatsLabelSaved
source: Saved
es: Ahorrado

# incrementalSyncStatsLabelSyncs
source: Syncs
es: Sincronizaciones

# incrementalSyncStatsLabelBandwidthSaved
source: Bandwidth Saved
es: Ancho de Banda Ahorrado

# incrementalSyncStatsLabelApiCallsSaved
source: API Calls Saved
es: Llamadas API Ahorradas

# incrementalSyncStatsLabelUpdateRate
source: Update Rate
es: Tasa de Actualización

# incrementalSyncStatsCurrentSync
source: Current Sync
es: Sincronización Actual

# incrementalSyncStatsDuration
source: Duration: {duration}
es: Duración: {duration}

# incrementalSyncStatsStatusSuccess
source: Status: Success
es: Estado: Exitoso

# incrementalSyncStatsStatusFailed
source: Status: Failed
es: Estado: Fallido

# incrementalSyncStatsByEntityType
source: By Entity Type:
es: Por Tipo de Entidad:

# incrementalSyncStatsEfficient
source: {rate}% efficient
es: {rate}% eficiente

# offlineBannerTitle
source: You're offline
es: Estás sin conexión

# offlineBannerMessage
source: Changes will sync when online.
es: Los cambios se sincronizarán cuando estés en línea.

# offlineBannerLearnMore
source: Learn More
es: Más información

# offlineBannerDismiss
source: Dismiss
es: Descartar

# offlineBannerSemanticLabel
source: You are offline. Changes will sync when you are back online. Swipe to dismiss or tap Learn More for details.
es: Estás sin conexión. Los cambios se sincronizarán cuando vuelvas a estar en línea. Desliza para descartar o toca Más información para detalles.

# transactionOfflineMode
source: Offline Mode
es: Modo Sin Conexión

# transactionOfflineSaveNew
source: Transaction will be saved locally and synced when online
es: La transacción se guardará localmente y se sincronizará cuando estés en línea

# transactionOfflineSaveEdit
source: Changes will be saved locally and synced when online
es: Los cambios se guardarán localmente y se sincronizarán cuando estés en línea

# transactionSaveOffline
source: Save Offline
es: Guardar Sin Conexión

# transactionSave
source: Save
es: Guardar

# transactionSavedSynced
source: Transaction saved and synced
es: Transacción guardada y sincronizada

# transactionSavedOffline
source: Transaction saved offline. Will sync when online.
es: Transacción guardada sin conexión. Se sincronizará cuando estés en línea.

source: Transaction saved
es: Transacción guardada

# syncStatusSynced
source: Synced
es: Sincronizado

# syncStatusSyncing
source: Syncing...
es: Sincronizando...

# syncStatusPending
source: {count} items pending
es: {count} elementos pendientes

# syncStatusFailed
source: Sync failed
es: Sincronización fallida

# syncStatusOffline
source: Offline
es: Sin conexión

# syncStatusJustNow
source: Just now
es: Ahora mismo

# syncStatusMinutesAgo
source: {minutes}m ago
es: hace {minutes}m

# syncStatusHoursAgo
source: {hours}h ago
es: hace {hours}h

# syncStatusDaysAgo
source: {days}d ago
es: hace {days}d

# syncStatusOverWeekAgo
source: Over a week ago
es: Hace más de una semana

# syncActionSyncNow
source: Sync now
es: Sincronizar ahora

# syncActionForceFullSync
source: Force full sync
es: Forzar sincronización completa

# syncActionViewStatus
source: View sync status
es: Ver estado de sincronización

# syncActionSettings
source: Sync settings
es: Configuración de sincronización

source: Sync started
es: Sincronización iniciada

# syncFullStarted
source: Full sync started
es: Sincronización completa iniciada
